{
    "intents": [
        {
            "tag": "greeting",
            "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
            "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"]
        },
        {
            "tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
            "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."]
        },
        {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
            "responses": ["Happy to help!", "Any time!", "My pleasure"]
        },
        {
            "tag": "noanswer",
            "patterns": [],
            "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"]
        },
        {
            "tag": "options",
            "patterns": ["How you could help me?", "What help you provide?", "How you can be helpful?"],
            "responses": ["I can guide you through Adverse management problems, order tracking, person to be contacted and Department related queries","I can provide support related to following problems technical query,management related query,order related query,tracking related query,procurement query,outsourcing problem,manufacturing delay,"]
        },
        {
            "tag": "login_issue",
            "patterns": ["I can't log in to my account", "I forgot my password", "I am having trouble accessing my account", "I can't access my account"],
            "responses": ["I am sorry to hear that you are having trouble logging in. Can you please provide me with more information such as the error message you are receiving or your account details so that I can assist you further?",
                          "If you have forgotten your password, you can reset it by visiting the account recovery page on our website. Would you like me to send you the link?",
                          "I understand that you are having trouble accessing your account. Are you able to provide more information about the issue so I can assist you better?",
                          "I am sorry to hear that you are having trouble accessing your account. Can you please provide me with more information so that I can assist you further?"]
        },
        {
            "tag": "course_information",
            "patterns": ["What are the prerequisites for this course?", "When is the next offering of this course?", "What is the syllabus for this course?", "How many credits is this course?"],
            "responses": ["The prerequisites for this course vary depending on the specific offering, but generally include a background in the relevant field and completion of any necessary prerequisites. Can you provide me with the name of the course you are inquiring about so I can give you more specific information?",
                          "The next offering of this course is currently scheduled for. However, this is subject to change. Please check the university's course schedule for the most up-to-date information.",
                          "The syllabus for this course includes insert information about course content [insert information about course content]. Can you provide me with the name of the course you are inquiring about so I can give you more specific information?"]
        },
        {
            "tag": "schedule_issue",
            "patterns": ["I am having trouble viewing my schedule", "I have a conflict in my schedule", "I need to add/drop a course"],
            "responses": ["I am sorry to hear that you are having trouble viewing your schedule. Can you please provide me with more information so that I can assist you further?",
                          "I understand that you have a conflict in your schedule. Have you considered reaching out to the professors of the conflicting courses to see if there is a solution?",
                          "I understand that you need to add/drop a course. Can you please provide me with more information about which course you need to add/drop and your current schedule so that I can assist you further?"]
        },
        {
            "tag": "tuition_issue",
            "patterns": ["I have a question about my tuition bill", "I need to set up a payment plan", "I am having trouble with financial aid"],
            "responses": ["I am sorry to hear that you have a question about your tuition bill. Can you please provide me with more information so that I can assist you further?",
                          "I understand that you need to set up a payment plan. Can you please provide me with more information so that I can assist you further?",
                          "I am sorry to hear that you are having trouble with financial aid. Can you please provide me with more information so that I can assist you further?"]
        },
        {
            "tag": "technical_support",
            "patterns": ["I am having trouble with my computer", "I need help with software installation", "I am having trouble with my university email"],
            "responses": ["I am sorry to hear that you are having trouble with your computer. Can you please provide me with more information such as the specific issue or error message you are encountering so that I can assist you further?",
                          "I understand that you need help with software installation. Can you please provide me with more information such as the specific software you are trying to install and any error messages you are encountering so that I can assist you further?",
                          "I am sorry to hear that you are having trouble with your university email. Can you please provide me with more information such as the specific issue or error message you are encountering so that I can assist you further?"]
        }
    ]
}

